In [1]:
import seaborn as sns

In [2]:
titanic = sns.load_dataset('titanic')

In [3]:
#타이타닉 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
df=titanic.loc[:,['age','fare']]

In [4]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [5]:
#df데이터 셋에 ten 컬럼 10을 넣어 추가하기
df['ten']=10

In [6]:
#10을 더하여 저장하는 add_10함수 생성하기
#두개의 변수를 더하여 저장하는 add_two_obj함수 생성하기
def add_10(n):
    return n+10

def add_two_obj(a,b):
    return a+b

In [7]:
#apply: 시리즈 데이터에 함수 적용하기
#시리즈 데이터 각각의 요소에 add_10함수 적용
sr1= df['age'].apply(add_10)
print(df['age'].head())
print(sr1.head())

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64
0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [8]:
sr2=df['age'].apply(add_two_obj,b=10)
print(sr2.head())

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [9]:
#람다 방식을 이용하여 add-10함수 실행하기
sr3=df['age'].apply(lambda x:add_10(x))
print(sr3.head())

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [11]:
#applymap: 데이터 프레임객체에 적용되어 데이터프레임객체 전체 요소에 실행됨
df_map=df.applymap(add_10)
print(df.head())
print(df_map.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10
    age     fare  ten
0  32.0  17.2500   20
1  48.0  81.2833   20
2  36.0  17.9250   20
3  45.0  63.1000   20
4  45.0  18.0500   20

In [12]:
def missing_value(series): #시리즈를 인수로 전달 
    return series.isnull() #불린 시리즈를 반환 

#dataframe.apply(적용함수, axis=0) #행기준, 열값=시리즈객체

In [13]:
result= df.apply(missing_value, axis=0)
print(df.head())
print(result.head())
print(type(result))

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10
     age   fare    ten
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
<class 'pandas.core.frame.DataFrame'>

In [16]:
#모든 시리즈에 최대값과 최소값의 차이를 출력하기
def max_min(s):
    return s.max()-s.min() #값으로 반환

In [17]:
result = df.apply(max_min,axis=0)
print(result)
print(type(result))

age      79.5800
fare    512.3292
ten       0.0000
dtype: float64
<class 'pandas.core.series.Series'>

In [18]:
#add_two_obj함수: 두개의 매개변수를 받아서 합을 리턴
#age컬럼과 ten 컬럼의 합을 add컬럼에 저장 
df['add'] = df['age']+df['ten']
print(df.head())

    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

In [21]:
#age컬럼과 ten컬럼의 합을 add2컬럼에 저장 
#add_two_obj 함수를 사용하기
#x:df의 한 행
df['add2'] = df.apply(lambda x:add_two_obj(x['age'],x['ten']),axis=1)
print(df.head())

    age     fare  ten   add  add2
0  22.0   7.2500   10  32.0  32.0
1  38.0  71.2833   10  48.0  48.0
2  26.0   7.9250   10  36.0  36.0
3  35.0  53.1000   10  45.0  45.0
4  35.0   8.0500   10  45.0  45.0

In [22]:
#각 열의 nan개수 반환 - 데이터프레임 전달하면 시리즈 반환 
def missing_count(x):
    return missing_value(x).sum()

#데이터프레임의 총 nan개수 - 데이터프레임 전달하면 값을 반환 
def total_number_missing(x):
    return missing_count(x).sum()

In [23]:
result = df.apply(missing_value)
print(result.head())
print(type(result))

     age   fare    ten    add   add2
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False
<class 'pandas.core.frame.DataFrame'>

In [24]:
result = df.apply(missing_count)
print(result.head())
print(type(result))

age     177
fare      0
ten       0
add     177
add2    177
dtype: int64
<class 'pandas.core.series.Series'>

In [25]:
result = df.pipe(missing_count)
print(result.head())
print(type(result))

age     177
fare      0
ten       0
add     177
add2    177
dtype: int64
<class 'pandas.core.series.Series'>

In [26]:
result = df.apply(total_number_missing)
print(result.head())
print(type(result)) #시리즈 객체

age     177
fare      0
ten       0
add     177
add2    177
dtype: int64
<class 'pandas.core.series.Series'>

# 데이터프레임 컬럼 관련 예제

In [27]:
df=titanic.loc[0:4, 'survived':'age']
print(df)

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [28]:
#열 이름의 리스트 만들기
print(df.columns)
columns = list(df.columns)
print(columns)
print(type(columns))

Index(['survived', 'pclass', 'sex', 'age'], dtype='object')
['survived', 'pclass', 'sex', 'age']
<class 'list'>

In [29]:
print(df.columns.values)
print(type(df.columns.values))

['survived' 'pclass' 'sex' 'age']
<class 'numpy.ndarray'>

In [30]:
#배열 객체를 리스트로 변환하기
columns = list(df.columns.values)
print(columns)
print(type(columns))

['survived', 'pclass', 'sex', 'age']
<class 'list'>

In [31]:
#열 이름을 알파벳순으로 정렬하기
columns_sorted = sorted(columns) #알파벳 순으로 정렬
print(columns_sorted)
#컬럼명 순으로 조회하기
df_sorted = df[columns_sorted]
print(df_sorted)

['age', 'pclass', 'sex', 'survived']
    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [32]:
#열 이름을 알파벳 역순으로 정렬
#컬렴명 역순으로 조회하기
columns_reversed = list(reversed(columns_sorted))
print(columns_reversed)
df_reversed = df[columns_reversed]
print(df_reversed)

['survived', 'sex', 'pclass', 'age']
   survived     sex  pclass   age
0         0    male       3  22.0
1         1  female       1  38.0
2         1  female       3  26.0
3         1  female       1  35.0
4         0    male       3  35.0

In [33]:
#열이름을 사용자가 정의한 임의의 순서로 재배치하기
columns_customed = ['pclass','sex','age','survived']
df_customed = df[columns_customed]
print(df_customed)

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

# 주가데이터 파일을 데이터프레임 객체로 저장

In [34]:
import pandas as pd

In [35]:
df = pd.read_excel('C:/pyy/주가데이터.xlsx', engine = 'openpyxl')
print(df)
print(df.dtypes)

          연월일   당일종가  전일종가     시가     고가     저가     거래량
0  2018-07-02  10100   600  10850  10900  10000  137977
1  2018-06-29  10700   300  10550  10900   9990  170253
2  2018-06-28  10400   500  10900  10950  10150  155769
3  2018-06-27  10900   100  10800  11050  10500  133548
4  2018-06-26  10800   350  10900  11000  10700   63039
5  2018-06-25  11150   150  11400  11450  11000   55519
6  2018-06-22  11300   100  11250  11450  10750  134805
7  2018-06-21  11200   350  11350  11750  11200  133002
8  2018-06-20  11550   250  11200  11600  10900  308596
9  2018-06-19  11300   700  11850  11950  11300  180656
10 2018-06-18  12000  1400  13400  13400  12000  309787
11 2018-06-15  13400    50  13600  13600  12900  201376
12 2018-06-14  13450   250  13200  13700  13150  347451
13 2018-06-12  13200  1250  12200  13300  12050  558148
14 2018-06-11  11950     0  12000  12250  11950   62293
15 2018-06-08  11950     0  11950  12200  11800   59258
16 2018-06-07  11950   200  12200  12300  11900   49088
17 2018-06-05  12150   250  11800  12250  11800   42485
18 2018-06-04  11900     0  11900  12200  11700   25171
19 2018-06-01  11900   100  11800  12100  11750   32062
연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
dtype: object

In [36]:
#연월일 컬럼으로 새로운 컬럼 생성
df['년'] = df['연월일'].dt.year
df['월'] = df['연월일'].dt.month
df['일'] = df['연월일'].dt.day
print(df.dtypes)

연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
년                int64
월                int64
일                int64
dtype: object

In [37]:
#연월일 컬럼을 문자열형으로 변경하여 연월일2 컬럼에 저장 
df['연월일2']=df['연월일'].astype('str')
print(df.dtypes)
print(df['연월일2'])

연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
년                int64
월                int64
일                int64
연월일2            object
dtype: object
0     2018-07-02
1     2018-06-29
2     2018-06-28
3     2018-06-27
4     2018-06-26
5     2018-06-25
6     2018-06-22
7     2018-06-21
8     2018-06-20
9     2018-06-19
10    2018-06-18
11    2018-06-15
12    2018-06-14
13    2018-06-12
14    2018-06-11
15    2018-06-08
16    2018-06-07
17    2018-06-05
18    2018-06-04
19    2018-06-01
Name: 연월일2, dtype: object

In [38]:
#문자열을 split() 메서드로 분리
#문자열의 멤버함수인 split()
#.str: 문자열로 형변환 
dates = df['연월일2'].str.split('-')
print(type(df['연월일2']))
print(df['연월일2'].dtype)
print(dates)

<class 'pandas.core.series.Series'>
object
0     [2018, 07, 02]
1     [2018, 06, 29]
2     [2018, 06, 28]
3     [2018, 06, 27]
4     [2018, 06, 26]
5     [2018, 06, 25]
6     [2018, 06, 22]
7     [2018, 06, 21]
8     [2018, 06, 20]
9     [2018, 06, 19]
10    [2018, 06, 18]
11    [2018, 06, 15]
12    [2018, 06, 14]
13    [2018, 06, 12]
14    [2018, 06, 11]
15    [2018, 06, 08]
16    [2018, 06, 07]
17    [2018, 06, 05]
18    [2018, 06, 04]
19    [2018, 06, 01]
Name: 연월일2, dtype: object

In [39]:
df['년2']=dates.str.get(0)
df['월2']=dates.str.get(1)
df['일2']=dates.str.get(2)
print(df.dtypes)
print(df.head())

연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
년                int64
월                int64
일                int64
연월일2            object
년2              object
월2              object
일2              object
dtype: object
         연월일   당일종가  전일종가     시가     고가     저가     거래량     년  월   일  \
0 2018-07-02  10100   600  10850  10900  10000  137977  2018  7   2
1 2018-06-29  10700   300  10550  10900   9990  170253  2018  6  29
2 2018-06-28  10400   500  10900  10950  10150  155769  2018  6  28
3 2018-06-27  10900   100  10800  11050  10500  133548  2018  6  27
4 2018-06-26  10800   350  10900  11000  10700   63039  2018  6  26

         연월일2    년2  월2  일2
0  2018-07-02  2018  07  02
1  2018-06-29  2018  06  29
2  2018-06-28  2018  06  28
3  2018-06-27  2018  06  27
4  2018-06-26  2018  06  26

# 필터: 조건에 맞는 데이터를 조회

In [40]:
#타이타닉 승객중 10댜(10~19세)인 승객만 조회하기
mask1 = (titanic.age >=10) & (titanic.age<20)
print(mask1.head())

0    False
1    False
2    False
3    False
4    False
Name: age, dtype: bool

In [41]:
df_teenage = titanic.loc[mask1,:]
print(df_teenage.head())

    survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
9          1       2  female  14.0      1      0   30.0708        C  Second
14         0       3  female  14.0      0      0    7.8542        S   Third
22         1       3  female  15.0      0      0    8.0292        Q   Third
27         0       1    male  19.0      3      2  263.0000        S   First
38         0       3  female  18.0      2      0   18.0000        S   Third

      who  adult_male deck  embark_town alive  alone
9   child       False  NaN    Cherbourg   yes  False
14  child       False  NaN  Southampton    no   True
22  child       False  NaN   Queenstown   yes   True
27    man        True    C  Southampton    no  False
38  woman       False  NaN  Southampton    no  False

In [43]:
#나이가 10세미만이고 여성인 승객만 따로 선택 
mask2 = (titanic.age<10) & (titanic.sex =='female')
df_female_under10 = titanic.loc[mask2,:]
print(df_female_under10)

     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
10          1       3  female  4.00      1      1   16.7000        S   Third
24          0       3  female  8.00      3      1   21.0750        S   Third
43          1       2  female  3.00      1      2   41.5792        C  Second
58          1       2  female  5.00      1      2   27.7500        S  Second
119         0       3  female  2.00      4      2   31.2750        S   Third
147         0       3  female  9.00      2      2   34.3750        S   Third
172         1       3  female  1.00      1      1   11.1333        S   Third
184         1       3  female  4.00      0      2   22.0250        S   Third
205         0       3  female  2.00      0      1   10.4625        S   Third
233         1       3  female  5.00      4      2   31.3875        S   Third
237         1       2  female  8.00      0      2   26.2500        S  Second
297         0       1  female  2.00      1      2  151.5500        S   First
374         0       3  female  3.00      3      1   21.0750        S   Third
381         1       3  female  1.00      0      2   15.7417        C   Third
448         1       3  female  5.00      2      1   19.2583        C   Third
469         1       3  female  0.75      2      1   19.2583        C   Third
479         1       3  female  2.00      0      1   12.2875        S   Third
530         1       2  female  2.00      1      1   26.0000        S  Second
535         1       2  female  7.00      0      2   26.2500        S  Second
541         0       3  female  9.00      4      2   31.2750        S   Third
618         1       2  female  4.00      2      1   39.0000        S  Second
634         0       3  female  9.00      3      2   27.9000        S   Third
642         0       3  female  2.00      3      2   27.9000        S   Third
644         1       3  female  0.75      2      1   19.2583        C   Third
691         1       3  female  4.00      0      1   13.4167        C   Third
720         1       2  female  6.00      0      1   33.0000        S  Second
750         1       2  female  4.00      1      1   23.0000        S  Second
777         1       3  female  5.00      0      0   12.4750        S   Third
813         0       3  female  6.00      4      2   31.2750        S   Third
852         0       3  female  9.00      1      1   15.2458        C   Third

       who  adult_male deck  embark_town alive  alone
10   child       False    G  Southampton   yes  False
24   child       False  NaN  Southampton    no  False
43   child       False  NaN    Cherbourg   yes  False
58   child       False  NaN  Southampton   yes  False
119  child       False  NaN  Southampton    no  False
147  child       False  NaN  Southampton    no  False
172  child       False  NaN  Southampton   yes  False
184  child       False  NaN  Southampton   yes  False
205  child       False    G  Southampton    no  False
233  child       False  NaN  Southampton   yes  False
237  child       False  NaN  Southampton   yes  False
297  child       False    C  Southampton    no  False
374  child       False  NaN  Southampton    no  False
381  child       False  NaN    Cherbourg   yes  False
448  child       False  NaN    Cherbourg   yes  False
469  child       False  NaN    Cherbourg   yes  False
479  child       False  NaN  Southampton   yes  False
530  child       False  NaN  Southampton   yes  False
535  child       False  NaN  Southampton   yes  False
541  child       False  NaN  Southampton    no  False
618  child       False    F  Southampton   yes  False
634  child       False  NaN  Southampton    no  False
642  child       False  NaN  Southampton    no  False
644  child       False  NaN    Cherbourg   yes  False
691  child       False  NaN    Cherbourg   yes  False
720  child       False  NaN  Southampton   yes  False
750  child       False  NaN  Southampton   yes  False
777  child       False  NaN  Southampton   yes   True
813  child       False  NaN  Southampton    no  False
852  child       False  NaN    Cherbourg    no  False

In [44]:
#나이가 10세 미만이거나 60세 이상인 승객의 age,sex,alone 컬럼만 조회
mask3 = (titanic.age <10) | (titanic.age>=60)
df_under10_morethan60 = titanic.loc[mask3,['age','sex','alone']]
print(df_under10_morethan60)

       age     sex  alone
7     2.00    male  False
10    4.00  female  False
16    2.00    male  False
24    8.00  female  False
33   66.00    male   True
..     ...     ...    ...
831   0.83    male  False
850   4.00    male  False
851  74.00    male   True
852   9.00  female  False
869   4.00    male  False

[88 rows x 3 columns]

In [46]:
#동행자의 수가 3,4,5인 승객들만 조회하기 
mask4 = (titanic.sibsp==3) | (titanic.sibsp==4) | (titanic.sibsp==5)
df_notalone = titanic.loc[mask4,:]
print(df_notalone)

     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
7           0       3    male   2.0      3      1   21.0750        S   Third
16          0       3    male   2.0      4      1   29.1250        Q   Third
24          0       3  female   8.0      3      1   21.0750        S   Third
27          0       1    male  19.0      3      2  263.0000        S   First
50          0       3    male   7.0      4      1   39.6875        S   Third
59          0       3    male  11.0      5      2   46.9000        S   Third
63          0       3    male   4.0      3      2   27.9000        S   Third
68          1       3  female  17.0      4      2    7.9250        S   Third
71          0       3  female  16.0      5      2   46.9000        S   Third
85          1       3  female  33.0      3      0   15.8500        S   Third
88          1       1  female  23.0      3      2  263.0000        S   First
119         0       3  female   2.0      4      2   31.2750        S   Third
164         0       3    male   1.0      4      1   39.6875        S   Third
171         0       3    male   4.0      4      1   29.1250        Q   Third
176         0       3    male   NaN      3      1   25.4667        S   Third
182         0       3    male   9.0      4      2   31.3875        S   Third
229         0       3  female   NaN      3      1   25.4667        S   Third
233         1       3  female   5.0      4      2   31.3875        S   Third
261         1       3    male   3.0      4      2   31.3875        S   Third
266         0       3    male  16.0      4      1   39.6875        S   Third
278         0       3    male   7.0      4      1   29.1250        Q   Third
341         1       1  female  24.0      3      2  263.0000        S   First
374         0       3  female   3.0      3      1   21.0750        S   Third
386         0       3    male   1.0      5      2   46.9000        S   Third
409         0       3  female   NaN      3      1   25.4667        S   Third
480         0       3    male   9.0      5      2   46.9000        S   Third
485         0       3  female   NaN      3      1   25.4667        S   Third
541         0       3  female   9.0      4      2   31.2750        S   Third
542         0       3  female  11.0      4      2   31.2750        S   Third
634         0       3  female   9.0      3      2   27.9000        S   Third
642         0       3  female   2.0      3      2   27.9000        S   Third
683         0       3    male  14.0      5      2   46.9000        S   Third
686         0       3    male  14.0      4      1   39.6875        S   Third
726         1       2  female  30.0      3      0   21.0000        S  Second
787         0       3    male   8.0      4      1   29.1250        Q   Third
813         0       3  female   6.0      4      2   31.2750        S   Third
819         0       3    male  10.0      3      2   27.9000        S   Third
824         0       3    male   2.0      4      1   39.6875        S   Third
850         0       3    male   4.0      4      2   31.2750        S   Third

       who  adult_male deck  embark_town alive  alone
7    child       False  NaN  Southampton    no  False
16   child       False  NaN   Queenstown    no  False
24   child       False  NaN  Southampton    no  False
27     man        True    C  Southampton    no  False
50   child       False  NaN  Southampton    no  False
59   child       False  NaN  Southampton    no  False
63   child       False  NaN  Southampton    no  False
68   woman       False  NaN  Southampton   yes  False
71   woman       False  NaN  Southampton    no  False
85   woman       False  NaN  Southampton   yes  False
88   woman       False    C  Southampton   yes  False
119  child       False  NaN  Southampton    no  False
164  child       False  NaN  Southampton    no  False
171  child       False  NaN   Queenstown    no  False
176    man        True  NaN  Southampton    no  False
182  child       False  NaN  Southampton    no  False
229  woman       False  NaN  Southampton    no  False
233  child       False  NaN  Southampton   yes  False
261  child       False  NaN  Southampton   yes  False
266    man        True  NaN  Southampton    no  False
278  child       False  NaN   Queenstown    no  False
341  woman       False    C  Southampton   yes  False
374  child       False  NaN  Southampton    no  False
386  child       False  NaN  Southampton    no  False
409  woman       False  NaN  Southampton    no  False
480  child       False  NaN  Southampton    no  False
485  woman       False  NaN  Southampton    no  False
541  child       False  NaN  Southampton    no  False
542  child       False  NaN  Southampton    no  False
634  child       False  NaN  Southampton    no  False
642  child       False  NaN  Southampton    no  False
683  child       False  NaN  Southampton    no  False
686  child       False  NaN  Southampton    no  False
726  woman       False  NaN  Southampton   yes  False
787  child       False  NaN   Queenstown    no  False
813  child       False  NaN  Southampton    no  False
819  child       False  NaN  Southampton    no  False
824  child       False  NaN  Southampton    no  False
850  child       False  NaN  Southampton    no  False

In [47]:
#isin() 함수 사용
mask5 = titanic['sibsp'].isin([3,4,5])
df_notalone = titanic[mask5]
print(df_notalone)

     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
7           0       3    male   2.0      3      1   21.0750        S   Third
16          0       3    male   2.0      4      1   29.1250        Q   Third
24          0       3  female   8.0      3      1   21.0750        S   Third
27          0       1    male  19.0      3      2  263.0000        S   First
50          0       3    male   7.0      4      1   39.6875        S   Third
59          0       3    male  11.0      5      2   46.9000        S   Third
63          0       3    male   4.0      3      2   27.9000        S   Third
68          1       3  female  17.0      4      2    7.9250        S   Third
71          0       3  female  16.0      5      2   46.9000        S   Third
85          1       3  female  33.0      3      0   15.8500        S   Third
88          1       1  female  23.0      3      2  263.0000        S   First
119         0       3  female   2.0      4      2   31.2750        S   Third
164         0       3    male   1.0      4      1   39.6875        S   Third
171         0       3    male   4.0      4      1   29.1250        Q   Third
176         0       3    male   NaN      3      1   25.4667        S   Third
182         0       3    male   9.0      4      2   31.3875        S   Third
229         0       3  female   NaN      3      1   25.4667        S   Third
233         1       3  female   5.0      4      2   31.3875        S   Third
261         1       3    male   3.0      4      2   31.3875        S   Third
266         0       3    male  16.0      4      1   39.6875        S   Third
278         0       3    male   7.0      4      1   29.1250        Q   Third
341         1       1  female  24.0      3      2  263.0000        S   First
374         0       3  female   3.0      3      1   21.0750        S   Third
386         0       3    male   1.0      5      2   46.9000        S   Third
409         0       3  female   NaN      3      1   25.4667        S   Third
480         0       3    male   9.0      5      2   46.9000        S   Third
485         0       3  female   NaN      3      1   25.4667        S   Third
541         0       3  female   9.0      4      2   31.2750        S   Third
542         0       3  female  11.0      4      2   31.2750        S   Third
634         0       3  female   9.0      3      2   27.9000        S   Third
642         0       3  female   2.0      3      2   27.9000        S   Third
683         0       3    male  14.0      5      2   46.9000        S   Third
686         0       3    male  14.0      4      1   39.6875        S   Third
726         1       2  female  30.0      3      0   21.0000        S  Second
787         0       3    male   8.0      4      1   29.1250        Q   Third
813         0       3  female   6.0      4      2   31.2750        S   Third
819         0       3    male  10.0      3      2   27.9000        S   Third
824         0       3    male   2.0      4      1   39.6875        S   Third
850         0       3    male   4.0      4      2   31.2750        S   Third

       who  adult_male deck  embark_town alive  alone
7    child       False  NaN  Southampton    no  False
16   child       False  NaN   Queenstown    no  False
24   child       False  NaN  Southampton    no  False
27     man        True    C  Southampton    no  False
50   child       False  NaN  Southampton    no  False
59   child       False  NaN  Southampton    no  False
63   child       False  NaN  Southampton    no  False
68   woman       False  NaN  Southampton   yes  False
71   woman       False  NaN  Southampton    no  False
85   woman       False  NaN  Southampton   yes  False
88   woman       False    C  Southampton   yes  False
119  child       False  NaN  Southampton    no  False
164  child       False  NaN  Southampton    no  False
171  child       False  NaN   Queenstown    no  False
176    man        True  NaN  Southampton    no  False
182  child       False  NaN  Southampton    no  False
229  woman       False  NaN  Southampton    no  False
233  child       False  NaN  Southampton   yes  False
261  child       False  NaN  Southampton   yes  False
266    man        True  NaN  Southampton    no  False
278  child       False  NaN   Queenstown    no  False
341  woman       False    C  Southampton   yes  False
374  child       False  NaN  Southampton    no  False
386  child       False  NaN  Southampton    no  False
409  woman       False  NaN  Southampton    no  False
480  child       False  NaN  Southampton    no  False
485  woman       False  NaN  Southampton    no  False
541  child       False  NaN  Southampton    no  False
542  child       False  NaN  Southampton    no  False
634  child       False  NaN  Southampton    no  False
642  child       False  NaN  Southampton    no  False
683  child       False  NaN  Southampton    no  False
686  child       False  NaN  Southampton    no  False
726  woman       False  NaN  Southampton   yes  False
787  child       False  NaN   Queenstown    no  False
813  child       False  NaN  Southampton    no  False
819  child       False  NaN  Southampton    no  False
824  child       False  NaN  Southampton    no  False
850  child       False  NaN  Southampton    no  False

In [48]:
#class 컬럼 중 first, second 인 행만 조회하기
df_12 = titanic[titanic['class'].isin(['First','Second'])]
print(df_12)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1           1       1  female  38.0      1      0  71.2833        C   First
3           1       1  female  35.0      1      0  53.1000        S   First
6           0       1    male  54.0      0      0  51.8625        S   First
9           1       2  female  14.0      1      0  30.0708        C  Second
11          1       1  female  58.0      0      0  26.5500        S   First
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
880         1       2  female  25.0      0      1  26.0000        S  Second
883         0       2    male  28.0      0      0  10.5000        S  Second
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
889         1       1    male  26.0      0      0  30.0000        C   First

       who  adult_male deck  embark_town alive  alone
1    woman       False    C    Cherbourg   yes  False
3    woman       False    C  Southampton   yes  False
6      man        True    E  Southampton    no   True
9    child       False  NaN    Cherbourg   yes  False
11   woman       False    C  Southampton   yes   True
..     ...         ...  ...          ...   ...    ...
880  woman       False  NaN  Southampton   yes  False
883    man        True  NaN  Southampton    no   True
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
889    man        True    C    Cherbourg   yes   True

[400 rows x 15 columns]